[
  {
    "url": "https://www.kitchener.ca/news/posts/mayor-vrbanovic-joins-canada-s-big-city-mayors-in-ottawa-cities-critical-partners-in-canada-s-prosperity/",
    "date": "Feb 06, 2026",
    "title": "Mayor Vrbanovic Joins Canada’s Big City Mayors in Ottawa Cities Critical Partners in Canada’s Prosperity",
    "content": [
      "Ottawa, Ontario –  Kitchener  Mayor Berry Vrbanovic  joined Canada’s Big City Mayors’ Caucus (BCMC)  in Ottawa  this week, where he met with Prime Minister Mark Carney and key federal ministers. During a series of group and individual meetings,  he worked with his Federation of Canadian Municipalities BCMC colleagues to  advance  both Kitchener and  shared priorities – priorities across Canada around housing, infrastructure,  transportation,  trade diversification, and more.",
      "Building on the momentum of these meetings, Mayor Vrbanovic emphasized the importance of predictable, long-term funding from all orders of government.",
      "“Canada’s big-city mayors are united in  our priorities as  we  look to  be  partners in prosperity with Ottawa to build strong cities and a strong, resilient Canada,” said Mayor Vrbanovic. “Kitchener  and other cities like us  are ready to work hand in hand with  both  federal and provincial/territorial governments ,” added Mayor Vrbanovic.  “Canada’s economic future runs through our cities, and we share Ottawa’s ambition and sense of urgency to tackle these challenges together,  but we need  funding programs to be setup  in a manner that allows us all to succeed .”",
      "BCMC mayors stressed the importance  to federal officials  of  expediting federal funding programs , particularly as housing remains a top national priority. Sustained federal investment is essential fo r cities to keep pace with rapid population growth,  rising  infrastructure demands, and  trade uncertainty.",
      "“We must work collaboratively, setting aside traditional mechanisms where necessary, to ensure budgeted dollars can flow quickly. By moving investments out the door faster, through FCM and other partners, cities can get projects underway, create jobs, and accelerate the construction of the infrastructure Canadians urgently need.”",
      "The BCMC continues to advocate for solutions that strengthen Canadian cities, including  the urgent need for reliable, long-term  infrastructure  funding,  renewing key housing and homelessness programs, and  tackling emerging public safety issues in our  cities.  These measures are essential to ensuring cities can meet housing targets, support affordability, and  maintain  the services  and quality of life priorities  Canadians rely on every day.",
      "“ As municipal leaders  who are  responding  daily to the pressures of  our growing communities,  we’re committed to doing our part,”  said Mayor Vrbanovic. “From o ur meeting with Prime Minister  Carney  to meetings with Ministers Francois-Philippe Champagne, Steven MacKinnon, Maninder Sidhu and others, I’m optimistic about the collaboration  we are seeing as  we work together with Canada’s new government , to strengthen housing, transit, and economic  growth  as part of Team Canada,  across the country from coast to coast to coast. ”",
      "-30-",
      "The Federation of Canadian Municipalities (FCM) unites more than 2,100 local governments at the national level, representing more than 92 per cent of Canadians in every province and territory.",
      "Federation of Canadian Municipalities media release .",
      "For more information, please contact:",
      "Shannon  Weber   Special Advisor to Mayor Vrbanovic  City of Kitchener  Weber.Shannon@kitchener.ca"
    ]
  },
  {
    "url": "https://www.kitchener.ca/news/posts/apply-now-to-host-a-neighbours-day-concert/",
    "date": "Feb 02, 2026",
    "title": "Apply now to host a Neighbours Day concert",
    "content": [
      "The City of Kitchener’s annual Neighbours Day returns to porches, driveways and front lawns across the city on Saturday, June 20 , from 12 p.m. to 5 p.m . Join us to celebrate community pride and local musical talent.",
      "100 Neighbours Day hosts needed",
      "Kitchener residents are invited to apply to host a concert on their porch, driveway or front lawn for their neighbours to enjoy. These hosts, or “Music Ambassadors,” provide the space to set the stage for an afternoon of fun.",
      "Neighbours Day organizers will pair a local musician with each Music Ambassador for a one-hour performance between 12 p.m. to 5 p.m. Ambassadors are required to provide an electrical outlet and an outdoor space at the front of their property for musicians to perform. Residents may plan additional activities to complement the concerts, such as games, food and refreshments, or they can simply sit back and enjoy the music and the company of their neighbours.",
      "Check out this video to learn more about Neighbours Day.",
      "If you’re interested in hosting a Neighbours Day concert, apply online at kitchener.ca/NeighboursDay."
    ]
  },
  {
    "url": "https://www.kitchener.ca/news/posts/sign-up-for-city-of-kitchener-e-billing-this-winter-and-win/",
    "date": "Feb 02, 2026",
    "title": "Sign up for City of Kitchener e-billing this winter and win!",
    "content": [
      "The City of Kitchener’s e-billing service brings your tax and utility accounts together in  one easy -to-use place. Through our self-service portal, you can view and pay bills,  monitor your utility usage, connect with customer service and more.",
      "There’s never been a better time to sign up, thanks to the contest launching today. Anyone who signs up for e -billing between now and Saturday, March 28,  2026 will be entered into a weekly draw for a $200 credit on their utility bill.",
      "Why make the switch to e-billing? It lets you:",
      "View your tax and utility bills online",
      "Pay your bill directly through the portal",
      "Track your utility consumption",
      "Access your account anytime",
      "Download and print your bills",
      "Submit customer service requests",
      "Assign someone to manage your account",
      "To get started, have your most recent City of Kitchener property tax or Kitchener Utilities bill on hand.  You’ll need the bill ID located in the top  right corner, along with the bill issue date.",
      "Learn more and sign up for your chance to win at kitchener.ca/ebilling .  This is a limited  time  offer, conditions may apply. Full contest  details are available on the website."
    ]
  },
  {
    "url": "https://www.kitchener.ca/news/posts/statement-black-history-month/",
    "date": "Feb 01, 2026",
    "title": "Statement: Black History Month",
    "content": [
      "February 1 marks the beginning of Black History Month – a  time  to  honour the legacy, brilliance, and resilience of Black communities in Kitchener and across the country.",
      "This year’s theme, “Celebrating 30 Years of Black History Month:  Honouring Black Brilliance Across Generations – From Nation Builders to Tomorrow’s Visionaries,” recognizes three decades of celebrating Black history in Canada.",
      "It  reminds  us of the countless ways Black Canadians have shaped this country, through leadership, creativity, innovation, and an enduring strength that has carried communities through generations.  Their contributions continue to influence our city today and will guide and inspire the  generations that follow.",
      "Black History Month is also a time to reflect  and be honest about the work  that  still needs to be done. It calls on all of us to recommit  to building a city where equity, belonging, and human rights are not just ideals, but everyday practices. That includes acknowledging and confronting anti‑Black racism, both its historical roots and the ways it continues to show up in our systems, institutions, and daily lives. A true sense of belonging means that people feel seen, valued, and safe, not only during moments of recognition, but in ordinary,  everyday spaces of life . It means creating a community where Black residents can thrive, contribute, and be their whole, authentic  selves without barriers.",
      "I encourage everyone to use this month as an opportunity to learn more about Black Canadian history and reflect on the challenges and accomplishments of Black Canadians. I invite you to learn,  participate, and celebrate.  Whether through  local  community events, storytelling, food, music, or reflection, there are so many different ways to engage.",
      "Let us all commit to building a Kitchener  -  and a world  -  where everyone feels they belong,  and  where every person has the freedom to live with dignity, pride, and possibility.",
      "Mayor Berry  Vrbanovic, on behalf of Kitchener Council"
    ]
  },
  {
    "url": "https://www.kitchener.ca/news/posts/kitchener-launches-2026-heritage-property-grant-intake/",
    "date": "Jan 29, 2026",
    "title": "Kitchener launches 2026 heritage property grant intake",
    "content": [
      "The City of Kitchener has opened a new round of funding for property owners  seeking  to conserve their culturally significant heritage buildings.",
      "If you have a project in mind  for your property, applications are open between now and  Wednesday,  April 15, 2026.",
      "Eligible applicants can receive u p to 50 per cent of project costs, with grants ranging from $500 to $5,000 for General Projects and up to $15,000 for Special  Projects.",
      "Buildings that qualify for the grant include those that are :",
      "Individually  designated under the Ontario Heritage Act",
      "Located within one of Kitchener’s heritage conservation districts ( St. Mary's,  Upper Doon,  Victoria Park,  Civic Centre)",
      "Funding is available for work that  conserves or restores heritage attributes, including:",
      "Conservation of original architectural elements",
      "Reconstruction of heritage features beyond repair",
      "Restoration of lost features with proper documentation",
      "Find out more about the grant, including whether you will  first  need a pre-consultation meeting with City staff, on  our  heritage funding page ."
    ]
  },
  {
    "url": "https://www.kitchener.ca/news/posts/statement-national-day-of-remembrance-of-the-quebec-city-mosque-attack-action-against-islamophobia/",
    "date": "Jan 29, 2026",
    "title": "Statement: National Day of Remembrance of the Québec City Mosque Attack & Action Against Islamophobia",
    "content": [
      "Today,  we mark the National Day of Remembrance of the Québec City Mosque Attack and Action Against Islamophobia.",
      "On January 29, 2017, six lives were taken  away in an act of terror.  We  remember Ibrahima Barry, Mamadou Tanou Barry, Khaled Belkacemi, Abdelkrim Hassane,  Azzeddine Soufia ne and Aboubaker Thabti  - men  who were murdered while worshipping at the Centre  Culturel  Islamique d e Québec.",
      "This was an attack on the fundamental values of safety, dignity, and freedom of worship. It was a  painful reminder that Islamophobia is real; it causes deep harm, has devastating consequences, and that we all share a responsibility to confront it wherever it appears.",
      "We stand firmly against Islamophobia, hatred, and all acts of terror. No one should ever  fear for their safety because of their faith or identity. Every community deserves to live in peace, dignity, and security.",
      "This commitment requires ongoing action — listening, learning, and speaking up against hate.",
      "Today and every day, we must  identify and address discrimination, support those affected by it, and work together to build a Kitchener and a world where everyone belongs. It takes each of us to choose to act with intention and courage.",
      "We must continue to foster a city,  a country, and a world  that is inclusive, respectful, and grounded in kindness and compassion. When we choose compassion over division and stand up for one another, we build a community where everyone feels safe, valued, and able to thrive.",
      "On this National Day of Remembrance of the Québec City Mosque Attack and Action Against Islamophobia, I urge  you to  learn more, support each other , and stand firmly against all forms of hate.",
      "As part of this commitment,  I encourage you to support the National Council of Canadian Muslims’  Green Square Campaign . The green square  represents the green carpets of the Centre Culturel  Islamique de Québec where the victims last knelt in prayer.",
      "In the week leading up to January 29, wear the green square in memory of the victims and in solidarity with the survivors, their families and friends, and Muslim communities across Canada .",
      "The Campaign is a call to action for all Canadians to stand  together for a society free of hatred and Islamophobia, not just  today, but every day!",
      "Mayor Berry Vrbanovic, on behalf of Kitchener Council"
    ]
  },
  {
    "url": "https://www.kitchener.ca/news/posts/city-of-kitchener-cancels-significant-weather-event-as-of-4-pm-january-27-2026/",
    "date": "Jan 27, 2026",
    "title": "City of Kitchener cancels significant weather event as of 4 p.m. January 27, 2026",
    "content": [
      "The City of Kitchener is cancelling the current significant weather event effective 4 p.m. on  Tuesday, January  27, 2026.",
      "Subscribe to the City’s  storm and emergency updates news feed to be notified when a significant weather event has been declared or cancelled. You can also follow the City of Kitchener’s Instagram ,  Facebook and X (formerly Twitter) accounts for updates .",
      "For more information about significant weather  events visit www.kitchener.ca/snow  or call our Corporate Contact Centre at 519-741-2345."
    ]
  },
  {
    "url": "https://www.kitchener.ca/news/posts/kitchener-council-approves-four-year-deal-with-cupe-68-civics-and-cupe-68-mechanics/",
    "date": "Jan 27, 2026",
    "title": "Kitchener Council approves four-year deal with CUPE 68 Civics and CUPE 68 Mechanics",
    "content": [
      "Kitchener City Council has approved a four-year deal between the City and the Canadian Union of Public Employees Locals 68 Civics and 68 Mechanics.",
      "The agreement runs from January 1, 2026, to December 31, 2029, and includes wage adjustments as follows:",
      "CUPE 68 Civic represents approximately 384 employees. CUPE 68 Mechanics represents approximately 30 employees.",
      "The previous contract expired on December 31, 2025."
    ]
  },
  {
    "url": "https://www.kitchener.ca/news/posts/bundle-up-for-winter-bike-to-work-day/",
    "date": "Jan 27, 2026",
    "title": "Bundle up for Winter Bike to Work Day",
    "content": [
      "Kitchener is encouraging residents to discover the joy of winter cycling and give cold-weather  biking a try at Winter Bike to Work Day.",
      "The celebration begins at 7:30 a.m. on Friday, February 13,  2026 at the Kitchener Cenotaph ( corner of Frederick and Duke Streets).  The  a group bike ride will follow the newly opened separated bike lanes in the Downtown Cycling Grid ,  including the recent transformation of East Avenue. Everyone who participates will receive a free coffee or hot chocolate, and there will be special prizes for first-time winter cyclists. winter cyclists.  Kitchener now  maintains more than 300 km of separated bike lanes and trails, designed to keep people active  year-round.",
      "With prizes, warm  drinks and a supportive community ride, it’s the perfect moment to try winter biking and see how enjoyable it can be.",
      "Find out more about the City of Kitchener’s cycling  infrastructure on  our  bike infrastructure page ."
    ]
  },
  {
    "url": "https://www.kitchener.ca/news/posts/city-of-kitchener-cancels-snow-event-and-parking-ban-as-of-6-pm-january-26-2026/",
    "date": "Jan 26, 2026",
    "title": "City of Kitchener cancels snow event and parking ban as of 6 p.m. January 26, 2026",
    "content": [
      "The City of Kitchener is cancelling the current snow event  effective  6 p.m. on Monday,  January 26, 2026. The street parking ban will be lifted once the snow event is cancelled.",
      "Even once the snow event is cancelled, City snow clearing crews will continue working to keep streets clear across the community, with plows continuing to  maintain priority streets and snow loading activities taking place overnight.",
      "Subscribe to the City’s  Snow Events news feed to be notified when a snow event has been declared, cancelled or extended. You can also follow the City of Kitchener’s Instagram ,  Facebook and X (formerly Twitter) accounts for updates .",
      "For more information about snow  events visit Kitchener.ca/snow or call our Corporate Contact Centre at 519-741-2345."
    ]
  }
]